<a href="https://colab.research.google.com/github/Rafi653/Machine-Learning/blob/feature%2Flab1-class/ML_PythonLecture1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
cd C:/Users/bidar/OneDrive/Desktop

C:\Users\bidar\OneDrive\Desktop

### A brief introduction to the language Python

[Python](http://www.python.org/) is a modern, general-purpose, object-oriented, high-level programming language. It is widely used in science and engineering, and has gained considerable traction in the domain of scientific computing over the past 5 years, some examples: 

+ Python is used at NASA for the Mars rover Curiosity mission 
+ The [Space Telescope Science Institute](http://www.stsci.edu/institute/software_hardware/pyraf/stsci_python) manages the operation of the Hubble Space Telescope with Python

Some positive attributes of Python that are often cited: 

* **Simple**: It is easy to read and relatively easy to learn (albeit not the easiest language to learn)
* **Expressive**: Fewer lines of code, fewer bugs and easy to maintain.
* **Powerful**: Python works as a script-type tool all the way to large projects, Big Data, High Performance Computing applications, data science, etc.
* **Batteries included**: The [**standard library**](http://docs.python.org/2/library/) is huge and includes some very useful libraries.
* **Many libraries**: There are tons of add-on libraries that will make your life easier, and guess what, they are all open source! So you can peek inside and change them at will.

A Python (or Jupyter) notebook implements Don Knuth's [literate programming](https://en.wikipedia.org/wiki/Literate_programming) idea: mixing code with english text to explain every piece of computation. It's perrrrrrrfect :-)

![Literate_Programming](https://upload.wikimedia.org/wikipedia/en/6/62/Literate_Programming_book_cover.jpg)

## Data Wrangling with Pandas

![kungfu-panda.png](attachment:kungfu-panda.png)


`pandas` is a Python package providing fast, flexible, and expressive data structures designed to work with relational or labeled (hierarchical) data or both. It is a fundamental high-level building block for doing practical, real world, **scientific data analysis** in Python.



`pandas` is well suited for:

- Tabular data with heterogeneously-typed columns, as in an SQL table or Excel spreadsheet

- Ordered and unordered (not necessarily fixed-frequency) *time series* (1D) data

- Arbitrary *matrix* (2 and higher D) data (homogeneously typed or heterogeneous) with row and column labels

- Any other form of observational / statistical data sets. The data actually need not be labeled at all to be placed into a pandas data structure

Key features are:

- Shape mutability: columns can be inserted and deleted from DataFrame and higher dimensional objects

- Automatic and explicit data alignment: objects can be explicitly aligned to a set of labels, or the data can be aligned automatically

- Intuitive merging and joining of data sets

- Flexible reshaping and pivoting of data sets

- Robust IO tools for loading data from flat files, Excel files, databases, HDF5, etc.

- Build-in statistics and linear regressions, extensible with additional packages (e.g. statsmodels)

After this lecture, chances are you will never use Excel functions to analyze data anymore, and instead you will import your excel spreadsheet into a notebook and use pandas & friends for your data analysis :-) .


The most important data structures in `pandas` are 1D **Series** (vectors) and 2D **dataframes** (matrices).

##### Installation of Pandas
If you have Python and PIP already installed on a system, then installation of Pandas is very easy.

Install it using this command:

 C:\Users\Your Name>pip install pandas

In [ ]:
conda install pip

##### Import Pandas
Once Pandas is installed, import it in your applications by adding the import keyword:

In [ ]:
import pandas

 Now Pandas is imported and ready to use.

#### Pandas as pd
Pandas is usually imported under the pd alias.

In [ ]:
import pandas as pd

## Pandas Data Types

 When doing data analysis, it is important to make sure you are using the correct data types; otherwise you may get unexpected results or errors. In the case of pandas, it will correctly infer data types in many cases and you can move on with your analysis without any further thought on the topic.

Despite how well pandas works, at some point in your data analysis processes, you will likely need to explicitly convert data from one type to another. We will discuss the basic pandas data types (aka dtypes ), how they map to python and numpy data types and the options for converting from one pandas type to another.

 A data type is essentially an internal construct that a programming language uses to understand how to store and manipulate data. For instance, a program needs to understand that you can add two numbers together like 5 + 10 to get 15. Or, if you have two strings such as “cat” and “hat” you could concatenate (add) them together to get “cathat.”

A possible confusing point about pandas data types is that there is some overlap between pandas, python and numpy. This table summarizes the key points:

Pandas dtype mapping

![Screenshot%20%2835%29.png](attachment:Screenshot%20%2835%29.png)

#### 1. Introduction to pandas Series
pandas Series are vectors!

In [ ]:
obj = pd.Series([10,20,30,40,50])
obj

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
obj.values

array([10, 20, 30, 40, 50], dtype=int64)

In [ ]:
obj.index

RangeIndex(start=0, stop=5, step=1)

 We can also specify an index that we pick:

In [ ]:
obj = pd.Series([10,20,30,40,50], index = ['a', 'b', 'c', 'd', 'e'])
obj

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [ ]:
obj['a'], obj[0]

(10, 10)

We can query data with predicates as index:

In [ ]:
obj[obj > 20]

c    30
d    40
e    50
dtype: int64

We can analyze NBA games, too:

In [ ]:
nba = {'Celtics': 3, "Heat": 4}
data = pd.Series(nba)
data

Celtics    3
Heat       4
dtype: int64

Hmm.. I think we need more than one dimension to analyze the NBA. Once we increase the number of dimensions, we move on pandas' DataFrame:

#### 2. Introduction to pandas DataFrames
pandas dataframes are excel spreadsheets, also known mathematically as matrices!

Let's import data as a dictionary structure:

In [ ]:
nba = {"east": ['Celtics', "Cavs", "76ers"], "west": ["Warriors", "Lakers", "Chicago"]}
nbadf = pd.DataFrame(nba)
nbadf

      east      west
0  Celtics  Warriors
1     Cavs    Lakers
2    76ers   Chicago

Let's look for another example of data types

In [ ]:
df = pd.DataFrame({'float': [1.0],
                   'int': [1],
                   'datetime': [pd.Timestamp('20180310')],
                   'string': ['foo']})
df.dtypes

float              float64
int                  int64
datetime    datetime64[ns]
string              object
dtype: object

Now, let's see how we can import dataset into our Jupyter Notebook from using different sources

In [ ]:
df1 = pd.read_csv('pokemon_data.csv')
df1.head(10)

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,78,104,78,159,115,100,1,False
9,7,Squirtle,Water,NaN,44,48,65,50,64,43,1,False

In [ ]:
#If it's a xlsx file we use the following code to load the data

store_data = pd.read_excel("Storedata.xlsx")
store_data.head()

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

###### Data Summary

dataframe.describe() is the function used to get summary of the dataset
For numeric data, the result’s index will include count, mean, std, min, max as well as lower, 50 and upper percentiles. By default the lower percentile is 25 and the upper percentile is 75. The 50 percentile is the same as the median.

In [ ]:
df1.describe()

,#,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation
count,800.000000,800.000000,800.000000,800.000000,800.000000,800.000000,800.000000,800.00000
mean,362.813750,69.258750,79.001250,73.842500,72.820000,71.902500,68.277500,3.32375
std,208.343798,25.534669,32.457366,31.183501,32.722294,27.828916,29.060474,1.66129
min,1.000000,1.000000,5.000000,5.000000,10.000000,20.000000,5.000000,1.00000
25%,184.750000,50.000000,55.000000,50.000000,49.750000,50.000000,45.000000,2.00000
50%,364.500000,65.000000,75.000000,70.000000,65.000000,70.000000,65.000000,3.00000
75%,539.250000,80.000000,100.000000,90.000000,95.000000,90.000000,90.000000,5.00000
max,721.000000,255.000000,190.000000,230.000000,194.000000,230.000000,180.000000,6.00000

In [ ]:
df1.shape
#Return a tuple representing the dimensionality of the DataFrame.

(800, 12)

In [ ]:
df1.info(verbose=True)
#This method prints information about a DataFrame including the index dtype and columns, non-null values and memory usage.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      414 non-null    object
 4   HP          800 non-null    int64
 5   Attack      800 non-null    int64
 6   Defense     800 non-null    int64
 7   Sp. Atk     800 non-null    int64
 8   Sp. Def     800 non-null    int64
 9   Speed       800 non-null    int64
 10  Generation  800 non-null    int64
 11  Legendary   800 non-null    bool
dtypes: bool(1), int64(8), object(3)
memory usage: 69.7+ KB

In [ ]:
df1.index
#The index (row labels) of the DataFrame.

RangeIndex(start=0, stop=800, step=1)

In [ ]:
df1.columns
#The column labels of the DataFrame.

Index(['#', 'Name', 'Type 1', 'Type 2', 'HP', 'Attack', 'Defense', 'Sp. Atk',
       'Sp. Def', 'Speed', 'Generation', 'Legendary'],
      dtype='object')

In [ ]:
df1.size

#Return an int representing the number of elements in this object.

#Return the number of rows if Series. Otherwise return the number of rows times number of columns if DataFrame.

9600

In [ ]:
obj

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [ ]:
obj.size

5

In [ ]:
df1.ndim

#Return an int representing the number of axes / array dimensions.

#Return 1 if Series. Otherwise return 2 if DataFrame.

2

In [ ]:
obj.ndim

1

In [ ]:
df1.isna()
#Detect missing values.
#Mask of bool values for each element in DataFrame that indicates whether an element is an NA value.

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,True,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
795,False,False,False,False,False,False,False,False,False,False,False,False
796,False,False,False,False,False,False,False,False,False,False,False,False
797,False,False,False,False,False,False,False,False,False,False,False,False
798,False,False,False,False,False,False,False,False,False,False,False,False
799,False,False,False,False,False,False,False,False,False,False,False,False

In [ ]:
df1.notna()

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,True,True,True,True,True,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,False,True,True,True,True,True,True,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...
795,True,True,True,True,True,True,True,True,True,True,True,True
796,True,True,True,True,True,True,True,True,True,True,True,True
797,True,True,True,True,True,True,True,True,True,True,True,True
798,True,True,True,True,True,True,True,True,True,True,True,True
799,True,True,True,True,True,True,True,True,True,True,True,True

##### Data indexing 

The axis labeling information in pandas objects serves many purposes:

1. Identifies data (i.e. provides metadata) using known indicators, important for for analysis, visualization, and interactive console display

2. Enables automatic and explicit data alignment

3. Allows intuitive getting and setting of subsets of the data set

Series: series[label] returns a scalar value

DataFrame: frame[colname] returns a Series corresponding to the passed column name

In [ ]:
df1.head()

#Prints first five rows of the dataset

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

In [ ]:
df1.at[4, 'Attack']
#

52

In [ ]:
nbadf.at[2,'east']

'76ers'

Access a single value for a row/column label pair.

Similar to loc, in that both provide label-based lookups. Use at if you only need to get or set a single value in a DataFrame or Series.

 Access a group of rows and columns by label(s) or a boolean array.

.loc[] is primarily label based, but may also be used with a boolean array.

In [ ]:
df1.loc[1]

#                   2
Name          Ivysaur
Type 1          Grass
Type 2         Poison
HP                 60
Attack             62
Defense            63
Sp. Atk            80
Sp. Def            80
Speed              60
Generation          1
Legendary       False
Name: 1, dtype: object

In [ ]:
nbadf.loc[1]

east      Cavs
west    Lakers
Name: 1, dtype: object

In [ ]:
dataframe = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
     index=['cobra', 'viper', 'sidewinder'],
     columns=['max_speed', 'shield'])
dataframe

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [ ]:
dataframe.loc['cobra']

max_speed    1
shield       2
Name: cobra, dtype: int64

iloc[] is  Purely integer-location based indexing for selection by position.

.iloc[] is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.

In [ ]:
type(df1.iloc[0])

pandas.core.series.Series

In [ ]:
df1.iloc[0]

#                     1
Name          Bulbasaur
Type 1            Grass
Type 2           Poison
HP                   45
Attack               49
Defense              49
Sp. Atk              65
Sp. Def              65
Speed                45
Generation            1
Legendary         False
Name: 0, dtype: object

In [ ]:
#With a list of integers.
df1.iloc[[0]]

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False

In [ ]:
#With a slice object.
df1.iloc[:3]

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False

In [ ]:
#With a boolean mask the same length as the index.
nbadf.iloc[[True, False, True]]

      east      west
0  Celtics  Warriors
2    76ers   Chicago

In [ ]:
#With a callable, useful in method chains. The x passed to the lambda is the DataFrame being sliced. 
#This selects the rows whose index label even.

df1.iloc[lambda x: x.index % 2 == 0]

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
6,6,Charizard,Fire,Flying,78,84,78,109,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,78,104,78,159,115,100,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
790,714,Noibat,Flying,Dragon,40,30,35,45,40,55,6,False
792,716,Xerneas,Fairy,NaN,126,131,95,131,98,99,6,True
794,718,Zygarde50% Forme,Dragon,Ground,108,100,121,81,95,95,6,True
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True

#### Indexing both axes

You can mix the indexer types for the index and columns. Use : to select the entire axis.

With scalar integers.

In [ ]:
df1.iloc[0, 9]

45

In [ ]:
df1.iloc[[0, 2], [1, 3]]

        Name  Type 2
0  Bulbasaur  Poison
2   Venusaur  Poison

DataFrame.insert(loc, column, value, allow_duplicates=False)

Insert column into DataFrame at specified location.

Raises a ValueError if column is already contained in the DataFrame, unless allow_duplicates is set to True.

In [ ]:
df1.insert(12, "New", "pikachu", allow_duplicates=False)
df1

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,New
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False,pikachu
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False,pikachu
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False,pikachu
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False,pikachu
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False,pikachu
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True,pikachu
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True,pikachu
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True,pikachu
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True,pikachu
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True,pikachu

#### Data conversion 

pandas.to_datetime

Convert argument to datetime.

Assembling a datetime from multiple columns of a DataFrame. The keys can be common abbreviations like [‘year’, ‘month’, ‘day’, ‘minute’, ‘second’, ‘ms’, ‘us’, ‘ns’]) or plurals of the same

In [ ]:
date_time = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
date_time

   year  month  day
0  2015      2    4
1  2016      3    5

In [ ]:
pd.to_datetime(date_time)

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]

In [ ]:
#passing errors=’ignore’ will return the original input instead of raising any exception.
pd.to_datetime('13000101', format='%Y%m%d', errors='ignore')

datetime.datetime(1300, 1, 1, 0, 0)

In [ ]:
#Passing errors=’coerce’ will force an out-of-bounds date to NaT, in addition to forcing non-dates (or non-parseable dates) to NaT.
pd.to_datetime('13000101', format='%Y%m%d', errors='coerce')

NaT

##### pandas.to_timedelta

Convert argument to timedelta.

Timedeltas are absolute differences in times, expressed in difference units (e.g. days, hours, minutes, seconds). This method converts an argument from a recognized timedelta format / value into a Timedelta type.

In [ ]:
#Parsing a single string to a Timedelta:
pd.to_timedelta('1 days 06:05:01.00003')

Timedelta('1 days 06:05:01.000030')

In [ ]:
pd.to_timedelta('15.5us')

Timedelta('0 days 00:00:00.000015500')

In [ ]:
#Parsing a list or array of strings:
pd.to_timedelta(['1 days 06:05:01.00003', '15.5us', 'nan'])

TimedeltaIndex(['1 days 06:05:01.000030', '0 days 00:00:00.000015500', NaT], dtype='timedelta64[ns]', freq=None)

#### pandas.date_range

Return a fixed frequency DatetimeIndex.

In [ ]:
# Specify start and end, with the default daily frequency.
pd.date_range(start='1/1/2018', end='1/08/2018')

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
#Specify start and periods, the number of periods (days).
pd.date_range(start='1/1/2018', periods=8)

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
#Other Parameters

#Changed the freq (frequency) to 'M' (month end frequency).

pd.date_range(start='1/1/2018', periods=5, freq='M')

DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31'],
              dtype='datetime64[ns]', freq='M')

In [ ]:
pd.date_range(start='1/1/2018', periods=5, freq='3M')

DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
               '2019-01-31'],
              dtype='datetime64[ns]', freq='3M')

In [ ]:
#Specify tz to set the timezone.
pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')

DatetimeIndex(['2018-01-01 00:00:00+09:00', '2018-01-02 00:00:00+09:00',
               '2018-01-03 00:00:00+09:00', '2018-01-04 00:00:00+09:00',
               '2018-01-05 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Tokyo]', freq='D')

#### pandas.to_numeric

Convert argument to a numeric type.

The default return dtype is float64 or int64 depending on the data supplied. Use the downcast parameter to obtain other dtypes.

In [ ]:
s = pd.Series(['1.0', '2', -3])
pd.to_numeric(s)

0    1.0
1    2.0
2   -3.0
dtype: float64

In [ ]:
s1 = pd.Series(['apple', '1.0', '2', -3])
pd.to_numeric(s1, errors='ignore')

0    apple
1      1.0
2        2
3       -3
dtype: object

In [ ]:
pd.to_numeric(s1, errors='coerce')

0    NaN
1    1.0
2    2.0
3   -3.0
dtype: float64

 Enough for today?

![sloth](https://tellingthetruth1993.files.wordpress.com/2015/06/sloth-from-imgsoup-com.jpg)

#### Any Questions??